# read design
#read_verilog counter_en_rst.v
#read_verilog three_st.v
#read_verilog counter_load.v
read_verilog counter_load16.v
#read_verilog counter_yosys.v
hierarchy -check

show

# high-level synthesis
proc; opt; fsm; opt; memory; opt


techmap; opt

write_verilog synth.v
